/***************************************************************************************************************
 Використовуючи IntelliJ IDEA, створіть клас NumbersCheck. Напишіть метод, який визначатиме:
 1)      чи є введене число позитивним, чи негативним;
 2)      чи є воно простим (використовуйте техніку перебору значень).
 Просте число – це натуральне число, яке ділиться на 1 й саме на себе. Щоби визначити просте число чи ні,
 варто знайти всі його цілі дільники. Якщо дільників більше 2-х, то воно не просте;
 3)      чи ділиться воно на 2, 5, 3, 6, 9 без залишку.
 ****************************************************************************************************************/

public class NumbersCheck {
 //   public static string PozitivNegativ
    public static void main(String[] args) {

    }
}
